Tekla Open API Reference for Tekla Structures 2025
MeshItemEnumerator Class
 The MeshItemEnumerator class allows to loop through the catalog mesh items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.MeshItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class MeshItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class MeshItemEnumerator
	Implements IEnumerator
The MeshItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a mesh item instance of the current element.
Top
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
SelectMeshItem
 Selects a mesh item in the mesh database with the given name and grade.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace